In [1]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [2]:
import pandas as pd
import warnings 
warnings.filterwarnings('ignore')

In [3]:
df1 = pd.read_csv('/content/drive/MyDrive/Colab Notebooks/apart/dataset.csv')
df1.head()

   Gu_Label  Dong_Label  Year  ...  YN_r  Station  Transaction_real_price
0         0           8    32  ...     1        1                  149500
1         0           8    33  ...     1        1                  144000
2         0           8    33  ...     1        1                  162750
3         0           8    33  ...     1        1                  160000
4         0           8    33  ...     1        1                  150000

[5 rows x 10 columns]

In [4]:
df2 = pd.read_excel('/content/drive/MyDrive/Colab Notebooks/apart/seoul_subway.xls')

In [5]:
df2 = df2[['Unnamed: 1','Unnamed: 2']]
df2.head()

  Unnamed: 1         Unnamed: 2
0        역 명          행정동(법정동)명
1     서울(1)역         회현동(봉래동2가)
2     시청(1)역          명동(태평로1가)
3     종각(1)역  종로1.2.3.4가동(종로1가)
4   종로3가(1)역  종로1.2.3.4가동(종로3가)

In [6]:
df2.columns = ['station','address']

In [7]:
df2.head()

    station            address
0       역 명          행정동(법정동)명
1    서울(1)역         회현동(봉래동2가)
2    시청(1)역          명동(태평로1가)
3    종각(1)역  종로1.2.3.4가동(종로1가)
4  종로3가(1)역  종로1.2.3.4가동(종로3가)

In [8]:
df2

        station            address
0           역 명          행정동(법정동)명
1        서울(1)역         회현동(봉래동2가)
2        시청(1)역          명동(태평로1가)
3        종각(1)역  종로1.2.3.4가동(종로1가)
4      종로3가(1)역  종로1.2.3.4가동(종로3가)
..          ...                ...
276  남한산성입구(8)역           단대동(단대동)
277   단대오거리(8)역          신흥2동(신흥동)
278      신흥(8)역          신흥3동(신흥동)
279      수진(8)역          수진1동(수진동)
280      모란(8)역          수진2동(수진동)

[281 rows x 2 columns]

In [9]:
df2.station = df2.station.str.split('(').str[0]

In [10]:
df2

    station            address
0       역 명          행정동(법정동)명
1        서울         회현동(봉래동2가)
2        시청          명동(태평로1가)
3        종각  종로1.2.3.4가동(종로1가)
4      종로3가  종로1.2.3.4가동(종로3가)
..      ...                ...
276  남한산성입구           단대동(단대동)
277   단대오거리          신흥2동(신흥동)
278      신흥          신흥3동(신흥동)
279      수진          수진1동(수진동)
280      모란          수진2동(수진동)

[281 rows x 2 columns]

In [11]:
# df2['station'].str.replace(pat=r'[^\w]', repl=r'', regex=True).str[:-2]

In [12]:
df2.loc[1]

station            서울
address    회현동(봉래동2가)
Name: 1, dtype: object

In [13]:
df2.address.str.find('(')

0       3
1       3
2       2
3      11
4      11
       ..
276     3
277     4
278     4
279     4
280     4
Name: address, Length: 281, dtype: int64

In [14]:
df2.drop([0],axis = 0,inplace=True)

In [15]:
a = df2.address.str.find('(')

In [16]:
b = df2.address.str.find(')')

In [17]:
df2.address.loc[1][a[1]+1:-1]

'봉래동2가'

In [18]:
for i in range(1,len(a)):
    df2.address.loc[i] = df2.address.loc[i][a[i]+1:-1]

In [19]:
df2.head()

  station address
1      서울   봉래동2가
2      시청   태평로1가
3      종각    종로1가
4    종로3가    종로3가
5    종로5가    종로5가

In [20]:
df2.address.value_counts()

신당동      7
가락동      6
상계동      6
방배동      5
사당동      4
        ..
종로5가     1
여의도동     1
동교동      1
광희동1가    1
석관동      1
Name: address, Length: 175, dtype: int64

In [21]:
df2[df2.address == '신당동']

    station address
16       신당     신당동
75       약수     신당동
148      청구     신당동
196    버티고개     신당동
197      약수     신당동
198      청구     신당동
199      신당     신당동

In [22]:
df3 = df2.drop_duplicates()

In [23]:
df3.columns = ['station','Dong']

In [24]:
df3 = pd.DataFrame(df3.Dong.value_counts())

In [25]:
df3.to_csv('/content/drive/MyDrive/Colab Notebooks/apart/subway_count.csv')